In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [9]:
%sql SELECT * FROM SongPlay LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(0, datetime.datetime(2018, 11, 29, 0, 0, 57, 796000), 'paid', None, 73, None, 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (1, datetime.datetime(2018, 11, 29, 0, 1, 30, 796000), 'paid', None, 24, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 29, 0, 4, 1, 796000), 'paid', None, 24, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 29, 0, 4, 55, 796000), 'paid', None, 73, None, 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (4, datetime.datetime(2018, 11, 29, 0, 7, 13, 796000), 'paid', None, 24, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM Users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(73, 'Jacob', 'Klein', 'M', 'paid'),
 (50, 'Ava', 'Robinson', 'F', 'free'),
 (4, 'Alivia', 'Terrell', 'F', 'free'),
 (24, 'Layla', 'Griffin', 'F', 'paid'),
 (54, 'Kaleb', 'Cook', 'M', 'free')]

In [5]:
%sql SELECT * FROM Song LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOINLJW12A8C13314C', 'City Slickers', 'AR8IEZO1187B99055E', 2008, Decimal('149.86404'))]

In [6]:
%sql SELECT * FROM Artist LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR8IEZO1187B99055E', 'Marc Shaiman', '', nan, nan)]

In [7]:
%sql SELECT * FROM Time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 29, 0, 0, 57, 796000), 0, 29, 48, 11, 2018),
 (datetime.datetime(2018, 11, 29, 0, 1, 30, 796000), 0, 29, 48, 11, 2018),
 (datetime.datetime(2018, 11, 29, 0, 4, 1, 796000), 0, 29, 48, 11, 2018),
 (datetime.datetime(2018, 11, 29, 0, 4, 55, 796000), 0, 29, 48, 11, 2018),
 (datetime.datetime(2018, 11, 29, 0, 7, 13, 796000), 0, 29, 48, 11, 2018)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [8]:
!python create_tables.py
!python etl.py

Traceback (most recent call last):
  File "create_tables.py", line 70, in <module>
    main()
  File "create_tables.py", line 61, in main
    cur, conn = create_database()
  File "create_tables.py", line 17, in create_database
    cur.execute("DROP DATABASE IF EXISTS sparkifydb")
psycopg2.OperationalError: database "sparkifydb" is being accessed by other users
DETAIL:  There is 1 other session using the database.

72 files found in data/song_data
1/72 files processed.
2/72 files processed.
3/72 files processed.
4/72 files processed.
5/72 files processed.
6/72 files processed.
7/72 files processed.
8/72 files processed.
9/72 files processed.
10/72 files processed.
11/72 files processed.
12/72 files processed.
13/72 files processed.
14/72 files processed.
15/72 files processed.
16/72 files processed.
17/72 files processed.
18/72 files processed.
19/72 files processed.
20/72 files processed.
21/72 files processed.
22/72 files processed.
23/72 files processed.
24/72 files processed.
25/72 files processed.
26/72 files processed.
27/72 files processed.
28/72 files processed.
29/72 files processed.
30/72 files processed.
31/72 files processed.
32/72 files processed.
33/72 files processed.
34/72 files processed.
35/72 files processed.
36/72 files processed.
37/72 files processed.
38/72 files processed.
39/72 files processed.
40/72 files processed.
41/72 files processed.
42/72 files processed.
43/72 files processed.
44/72 files processed.
45/72 files processed.
46/72 files processed.
47/72 files processed.
48/72 files processed.
49/72 files processed.
50/72 files processed.
51/72 files processed.
52/72 files processed.
53/72 files processed.
54/72 files processed.
55/72 files processed.
56/72 files processed.
57/72 files processed.
58/72 files processed.
59/72 files processed.
60/72 files processed.
61/72 files processed.
62/72 files processed.
63/72 files processed.
64/72 files processed.
65/72 files processed.
66/72 files processed.
67/72 files processed.
68/72 files processed.
69/72 files processed.
70/72 files processed.
71/72 files processed.
72/72 files processed.
31 files found in data/log_data
1/31 files processed.
2/31 files processed.
3/31 files processed.
4/31 files processed.
5/31 files processed.
6/31 files processed.
7/31 files processed.
8/31 files processed.
9/31 files processed.
10/31 files processed.
11/31 files processed.
12/31 files processed.
13/31 files processed.
14/31 files processed.
15/31 files processed.
16/31 files processed.
17/31 files processed.
18/31 files processed.
19/31 files processed.
20/31 files processed.
21/31 files processed.
22/31 files processed.
23/31 files processed.
24/31 files processed.
25/31 files processed.
26/31 files processed.
27/31 files processed.
28/31 files processed.
29/31 files processed.
30/31 files processed.
31/31 files processed.